{

  "regEx_array":[
    {
      "regEx" : "\\S\\.\\.\\.\\S",
      "desc" : "ellipsis ( ... ) In general, treat an ellipsis as a three-letter word, constructed with three periods and two spaces. If the words that precede an ellipsis constitute a grammatically complete sentence, either in the original or in the condensation, place a period at the end of the last word before the ellipsis. Follow it with a regular space and an ellipsis"
    },
    {
      "regEx" : "said[^.]",
      "desc" : "For attributions: AP Style puts more emphasis on source name than the word said. Place said after the source name."
    },
    {
      "regEx" : "\\sam\\s",
      "desc" : "For time: lowercase, with periods. Avoid the redundant 10 a.m. this morning. The abbreviations are correct only with figures."
    },
    {
      "regEx" : "\\spm\\s",
      "desc" : "For time: lowercase, with periods. Avoid the redundant 10 p.m. this evening. The abbreviations are correct only with figures."
    },
    {
      "regEx" : "a\\.m\\.\\.",
      "desc" : "Period after a.m. at the end of a sentence is not required. Add other puncuation, though (such as a.m.;)."
    },
    {
      "regEx" : "p\\.m\\.\\.",
      "desc" : "Period after p.m. at the end of a sentence is not required. Add other puncuation, though (such as p.m.;)."
    },
    {
      "regEx" : "\\Spm\\S",
      "desc" : "For time: For time: lowercase, with periods. Avoid the redundant 10 p.m. tonight. he abbreviations are correct only with figures."
    },
    {
      "regEx" : "tomorrow",
      "desc" : "Use only in direct quotations and in phrases that do not refer to a specific day: The world of tomorrow will need additional energy resources. Use the day of the week in other cases."
    },
    {
      "regEx" : "yesterday",
      "desc" : "placeholder"
    },
    {
      "regEx" : "Calif",
      "desc" : "placeholder"
    },
    {
      "regEx" : "  +",
      "desc" : "placeholder"
    },
    {
      "regEx" : "\\s[0-9]\\s",
      "desc" : "placeholder"
    }
  ]

}
